[
    {
        "created_time": "2022-07-16 20:03:26",
        "self_text": "I hate everything about this column. Specifically shit like this:\n\n*And whatever the outcome, the fateful step of bringing charges against a former president based on his conduct in office could unleash a dangerous cycle of tit-for-tat political prosecutions and revenge prosecutions. This is the stuff of banana republics, not the American system of justice.*\n\nSorry, but this whole line of thinking is fucking bullshit. Nobody is supposed to be above the law, period. There should be ZERO trepidation about prosecuting a former President for CRIMES they committed in office, for the fucking obvious reason that OTHERWISE YOU CREATE AN INCENTIVE FOR PRESIDENTS TO COMMIT CRIMES WITH IMPUNITY. Which is what we now have. Prosecuting former leaders for actual crimes they committed is not the \"stuff of banana republics\" either, it's the stuff of [major](https://en.wikipedia.org/wiki/Trials_and_allegations_involving_Silvio_Berlusconi), [developed](https://www.nytimes.com/2019/11/21/world/middleeast/netanyahu-corruption-indicted.html) [democracies](https://www.bbc.com/news/world-asia-37966494) that respect the rule of law. Making the President immune from prosecution - that is some banana republic bullshit, not the other way around. I hate, hate hate everything about this column. Fuck off. I don't care if it leads to tit-for-tat prosecutions by bullshit Republicans, they're already doing stuff like that anyway. And I don't care if a huge percentage of the population \"doesn't accept\" the outcome, if the outcome is correct. We can deal with that as it comes. What we don't do is be too clever by half and preemptively decide to let corruption and criminality happen in government because Republicans would complain otherwise. Fuck everything this lady said. Fuck."
    },
    {
        "created_time": "2018-07-10 17:46:30",
        "self_text": "At the same time though, it doesn't seem like this will actually get these people to change what they're doing, given what the article described. And the risks are\n\nA) Turn the right into martyrs\n\nB) Provoke a backlash in general\n\nC) Entrench those officials in their own beliefs as is.\n\nMy big issue is that there's no limiting principle on this once you start harassing public officials and not protesting their general actions. Should resturants exclude them? Grocery stores? Dry cleaners? Bowling alleys?\nFor the protesters, the goal seems to be to shut them out of public life completely, which I think would only fracture our society politically even more."
    },
    {
        "created_time": "2021-01-03 02:21:01",
        "self_text": "&gt;Consequently, he is plainly out of sorts, say former close associates, longtime Trump watchers and mental health experts.\n\n\n*The American Psychological Association does not have a Goldwater Rule per se, but our Code of Ethics clearly warns psychologists against diagnosing any person, including public figures, whom they have not personally examined. Specifically, it states: “When psychologists provide public advice or comment via print, Internet or other electronic transmission, they take precautions to ensure that statements (1) are based on their professional knowledge, training or experience in accord with appropriate psychological literature and practice; (2) are otherwise consistent with this Ethics Code; and (3) do not indicate that a professional relationship has been established with the recipient.”*\n\n\nSusan H. McDaniel \nPresident \nAmerican Psychological Association \nWashington"
    },
    {
        "created_time": "2020-12-23 05:01:45",
        "self_text": "\"Also, we have it on good authority¹ that Michelle is a man, so, like, ~~gay~~ trans agenda².\"\n\n¹Good authority may or may not be³ shady ass websites with names like Patriot News or Freedom Speech Press that constantly peddle barely comprehensible conspiracy theories.\n\n²Hey, coming up with new ideas is hard and this still scares our intended audience, so it's way easier to just repackage it. It's like the best⁴ way to recycle!\n\n³Totally are\n\n⁴Okay, it's not. In fact, it's a pretty terrible analogy but since when has nuance meant anything? Besides, these suckers⁵ will believe anything if you toss a few buzzwords in there.\n\n⁵Yeah, no, they didn't even read the first footnote and we're five deep now, so I can basically say whatever I want about them."
    },
    {
        "created_time": "2022-05-07 00:37:52",
        "self_text": "We're beyond consequences for the GOP. If I can say one thing about Republicans it's that they fall in line and the last 6 years has continually tested that and they are still hitting their goals despite the Democratic majority while the Dems have come up short comparatively. Maybe at some point it will become too much for enough of them that they will turn on them, but think we'll be waiting in vain if the plan is to wait for some sort of moral upheaval from within to curb their trajectory. I think that if anything is going to derail them it's going to come from some someone like Desantis or Cotton getting ambitious and challenging the hierarchy prematurely causing an internal conflict. Honestly if Biden and the DNC leadership came out strongly and consistently in support of federal weed legalization and some type of meaningful corruption reform they could get a lot of people excited. They don't even have to actually do it, but just get people excited about something and that could be enough to get us through this midterm. Or we can continue to support dubious quasi-democrats who are going to hamstring the agenda for the second half of Biden's term and go into the presidential election completely deflated."
    },
    {
        "created_time": "2023-12-28 05:20:35",
        "self_text": "They were protecting a \"way of life\".\n\nAnd this is why this still matters today.\n\nAnd what was that \"way of life\" all about, one may ask? It included a certain idea of manhood. An idea very intricately tied to violence. The slave had a role in this society; he was an acceptable outlet for this violence that was part of an identity that included slavery.\n\nThis is what right-wingers have always demanded: The right to oppress. Their identity is built on it.\n\nAnd this is why the ideology has absolutely no place in the XXIst century. It is rooted in an evil mentality. The cruelty is the point."
    },
    {
        "created_time": "2024-01-12 08:04:08",
        "self_text": "The Republican party in the US reminds me so damn much of 4chan. When it was new, all the users used shock value as a form of humor, but only that. After a while it started attracting people that actually thought that way, until the racists and incels vastly outnumbered the normal ass weebs.\n\nRepublicans have utterly depended on lying to and manipulating vulnerable Americans. Kept them sick and stupid, made the GOP the pinnacle of American politics. They were smart and leant on the backs of the stupid, right up until the stupid had a mind to endeavor to become who they idolized. Now there's a big giant pile of Republican idiots who are trying the same old tactics of lying and manipulating, but they're too stupid to out-maneuver anyone more intelligent than them, which is pretty much anyone of average intellect that refuses the Kool-Aid.\n\nThey nurtured a whole new generation of conservatives to be both cocksure and as bright as vantablack."
    },
    {
        "created_time": "2024-04-09 14:57:05",
        "self_text": "&gt;I don't know what you mean by \"denying from the child\".\n\nA parent can't decide that a child doesn't get child support. That's not their legal place to do so. A parent doesn't have the legal right to do so.  \n\nThe fact that you believe it's a parent's right to decide this shows how little you understand child support laws. \n\n&gt;If he/she refuses to accept the money (or returns it) there is nothing the child can do\n\nNot true. Children have sued their parents in the past over a lack of child support being accepted. And been successful. Because again, child support is for the child, not the parent. A parent can't decide that the child doesn't get it. \n\n&gt;if the parents make an agreement that the absent parent doesn't have to pay anything or the paid money is returned to him/her, then what exactly happens?\n\nThen that is a meaningless agreement since neither parent is in a legal position to make such an agreement. The recourse would be the child suing their parents to make sure they are receiving what they are owed."
    },
    {
        "created_time": "2024-04-29 00:50:29",
        "self_text": "I find it hard to have any confidence in polls that claim that \"black and latino\" voters are becoming republican, considering the exceptional track record of republican lawmakers (Trump included) being unable to denounce white supremacy, and the incredible lack of non-white republican lawmakers. Polling is an incredibly potent tool in manipulating the perspective of prospective or on-the-fence voters, and finding unbiased polls on topics like these are incredibly difficult to find. \n\nTraditionally the most blue areas of any state are the highly populated urban areas, which also happen to be the most diverse, so claiming that these areas are suddenly being bolstered with Trump-supporting converts is just hard to believe. Not saying it's impossible, but being in a fairly diverse area of an otherwise conservative state, I have found no substantial republican support from any non-white people or communities.\n\nEdited for spelling"
    },
    {
        "created_time": "2023-12-31 05:43:34",
        "self_text": "The details here get sticky. Most places have limits on when an abortion can be obtained, let's day 16 weeks. Most women find out that they're pregnant at 6 weeks. That gives 10 weeks to alert the father, make a decision,  get an appointment with a lawyer, have an investigation, schedule a doctor's appointment, schedule a second appointment and also have an abortion. My doctors office right now is scheduling patients 8 weeks out. Getting an attorney can take weeks. So by week 30, he has the documentation and signs away his rights, and she's WAYYY past the point of an abortion. \n\n\n\nAlso, how do you stop a man from lying about it? He swears he's not going to ditch her, swears he's gonna be there, and then once the time for an abortion passes he says \"just kidding I'm out!\". \n\n\n\nSo, there must be a time limit for men too. Let's say it must be 8 weeks before the time for an abortion. Soooo...what's to stop women from waiting to tell men? Purposely only telling men once the time for THEM to financially abortion has passed? \n\n\n\nFinancial abortion is a great fantasy but logistically and practically its borderline impossible to implement in any way that would be \"fair\" and simply trying to fix an unfair situation with another unfair situation is not the answer."
    }
]