[
    {
        "created_time": "2024-04-28 04:47:35",
        "self_text": "&gt; liberal\n\nNope, not really. They are actual quite conservative. Compared to regressive islamists they might seem quite liberal, but on the political spectrum they are not liberal at all.\n\n&gt;Hamas is a terrorist group, everything they do is reprehensible.\n\nHamas is the democratically elected government of gaza and they are overwhelmingly supported by the populace of gaza. So if they are so reprehensible, that would also apply to anyone that actively supports them, which is the grand majority of gazans.\n\n&gt;I expect better from Israel than I do of Hamas.\n\nWhy? Why do you hold them to a higher standard? Why is ok for one side to start a war but not ok for the other side to defend themselves? You realize the gazans rain rockets from the sky over isreal literally daily for decades? Well before this war? Seriously the air defense sirens in israel are just a daily part of their life, because gazans with rocket launchers shoot rockets at israel literally every single day.\n\nTo me israel easily meets a higher standard already. The government of israel has a responsibity to protect the people of Israel whether they want to or not, that is part of the job. They have to route out hamas once and for all, they simply have to after the latest escalation commited by hamas on 10/7. Again, hamas is the democratically elected governemnt of gaza that is overwhelmingly supported by the populace of gaza. \n\nYou hold the side defending themselves from a foreign invasion to a higher standard, what a joke. There is only one standard; don't start a war unless you want a damn war. Don't expect the superior military to just let you shoot rockets at them. \n\nAll ask you this, if Israel pulls out of gaza do you think hamas will release all the hostages and stop firing rockets at israel? Because I don't believe they will, and as long as that is the case the war will not end any time soon. It literally can't end, Israel has the right AND the responsibility to defend themselves, it is offensively absurd that you expect them not to."
    },
    {
        "created_time": "2024-05-08 23:58:38",
        "self_text": "People want Palestinian statehood, and majority of the world recognize the state of Palestine. That means people need to recognize the concept of sovereignty, and acknowledge the current ruling governance of the state of Palestine.\n\nPeople can’t have their cake and eat it too.\n\nIf entities like Russia can be held responsible for the atrocities they are committing to their own and neighboring populations (propaganda, conscription, autocratic plutocracy) than there really is no reason to not hold the state of Palestine to those same scrutinies.\n\nIt’s fucking backwards how people are protesting *against* Russia, but *for* Palestine when the repercussions being enacted against them is as a result of their own sovereign government’s actions.\n\nPalestinians are as nationalistic as Russians are."
    },
    {
        "created_time": "2024-04-14 04:03:20",
        "self_text": "They are effective at killing civilians, specifically unarmed civilians, but they have yet to achieve any military aims. And as video evidence from Hamas and the other Palestinian Resistance factions show, they are losing tanks, armored vehicle, and soldiers at an alarmingly rate.\n\n&amp;#x200B;\n\nAs for Germany, I am totally serious. Germany seems to dig Israel a lot, they were the perpetrator of the worst crime against humanity ever, I'm sure they would be down for giving up Schleswig-Holstein, Hamburg, Bremen, Niedersachsenn, Nodrhein-Westfalen, Anhalt, Bradenburg, Saxony, Meckleburg-Vorpommern, and the part of the sacred city of Berlin, the Germans can keep the eastern portion as their capital.\n\n&amp;#x200B;\n\nCologne Cathedral is there, they don't have to demolish Al-Asqa Mosque in order to make their weird fucking temple for red heifer sacrifice when they already have a perfectly suitable alternative."
    },
    {
        "created_time": "2024-05-01 11:12:55",
        "self_text": "Well I was specifically clearing up a misconception about the Nakba, which was a very concentrated bout of expulsions. Even before the Arab League took a single action or made a single statement, by April of 1948 more than 300,000 Arabs had fled because of violence of the threat of violence.\n\nSaying that all of the Palestinians left because the Arab League told them to is only applicable to Haifa, really, and even then not really.\n\nFinally, it’s an irrefutable fact that the expulsion of Palestinian largely preceded the various different expulsions of Jewish people from different Muslim countries which happened over years and in some places was more of a process of discrimination and out-migration than a single violent program that caused them to fleet for their lives. Using the Nakba to justify these expulsions is completely or vice versa is completely wrong and I’m not doing that; I’m just trying to help explain the historical events.\n\nI recommend reading Benny Morris if you’re interested. He’s an Israeli historian, and though he’s a big supporter of Israel he nonetheless has done a great job exploring the reality of what happened; not simply parroting a self serving narrative."
    },
    {
        "created_time": "2023-12-13 05:21:16",
        "self_text": "I think the difference really comes down to a few key elements \n\nIsraeli supporters - \nAverage - view bombing as justified, recognize Israel is trying to limit civilian casualties. Believe Hamas must be eliminated\nFringe - believe all Palestinians should be killed - this is a small minority, slightly larger in Israel \n\nPalestinian supporters\n\nAverage - believe Palestinians deserve basic rights, believe Jews are attempting a genocide, decry the bombings as inhuman\n\nFringe - believe Hamas is a morally right group, and October 7th was a great victory - surprisingly large “fringe group”, and incredibly prominent sentiment inside Palestine\n\n\nThe problem is the fringe groups of Palestine supporters are more prevalent, don’t see Israel as human, and support terrorism. Because of this they are more likely to turn peaceful protests violent"
    }
]