[
    {
        "created_time": "2022-08-29 01:49:57",
        "self_text": "Anyone else dealing with consumerism withdrawals? \n\nI’ve made a promise to myself to stop buying things I don’t need (my last unnecessary purchase was about 6 weeks ago) and I’m def feeling jittery. Even before, when I would go shopping I would buy 2nd hand, but I’ve been able to scale down to a capsule wardrobe (I work from home so it’s mostly sweats and leggings), I still feel like I need to go out and get “new new new” (or more apt “thrift thrift thrift”). I’m also dealing with the projected disgust over thrift hauls or any clothing consumption(which is something I’m working on in therapy). \n\nI don’t know, just wanted to see if anyone else is in the same boat."
    },
    {
        "created_time": "2022-05-03 15:56:32",
        "self_text": "The thing is, until the corporations are eliminated, individual efforts are useless. Like trying to stop a river by spitting at it against the flow. Sure, maybe we *could* do it, *if* we got *everyone* on board, or at least a huge majority. But that simply isn't in the cards. It's a political impossibility. You could spend your whole life living sustainably, preaching the green to anyone who will listen, doing everything in your power to lessen the ecological impact of your life and those around you and promote the healing of the planet.\n\nAll of it would be effectively undone by one average random dude living his life. He wouldn't even need to be egregious or especially bad - just an ordinary normal life, and he cancels out everything you've done, every sacrifice you've made, without even meaning to. \n\nIndividual consumption is a complete waste of time and effort. It is entirely useless, very little more than grandstanding that allows one to feel a sense of moral superiority. The *only* action that matters is stopping things at the root of the issue, at the source, and that is our economy and the corporations that control it. Anything short of that is mere performance. Corporations don't need to be held to account, they need to be physically eliminated, with extreme prejudice. So long as we continue to bleat our lines about personal responsibility and individual consumption, they continue to win, because they're setting us upon a battle field that we cannot win. Think about it - if yelping about individual responsibility actually changed anything at all, so you honestly think that they would be telling us to do so?"
    },
    {
        "created_time": "2022-10-26 05:53:31",
        "self_text": "Personally I've switched my position on nuclear numerous times over the years as I've learned more about it, and currently I don't see it as a leading solution to climate change, not even close.\n\n- high costs when all is said and done\n- not enough manpower available to plan, build, or run them (look at Frances problems)\n- fuel Outlook worldwide not secure for the amount needed\n- most importantly: they take a minimum of 20 years of time from first idea to power on, which is time much better spent on renewables.\n- they need another 10 to 15 years to become emission neutral, or to reach the point when the saved CO2 emissions neutralize those used to build it, which are significant. This leads to 30 years until there's *any* positive effect on the climate. Wind turbines need 9 months of running to be neutral and can be built in 2 to 3 years.\n- If you also consider that if you go all in on nuclear you also keep using the current grid for the buildtine, which is absolutely horrible for the climate in many, many countries, the CO2 per kWh values also stop being \"climate friendly\". This is not taken into account often but absolutely needs to. \n\nIn summary there's a reason many companies and governments don't want to commit to it, and it's not the reddit narrative of an anti nuclear conspiracy due to some hippies or something\n\nE: I will add that I so not conciser the safety issues to be a real problem in comparison to climate change. Coal power is also killing like 1000 times more people per year than nuclear did in it's entire lifetime"
    },
    {
        "created_time": "2019-06-12 19:28:12",
        "self_text": "Study (open access): [Global ensemble projections reveal trophic amplification of ocean biomass declines with climate change](https://www.pnas.org/content/early/2019/06/10/1900194116)\n____\n\n**Significance**\n\nClimate change can affect the distribution and abundance of marine life, with consequences for goods and services provided to people. Because different models can lead to divergent conclusions about marine futures, we present an integrated global ocean assessment of climate change impacts using an ensemble of multiple climate and ecosystem models. It reveals that global marine animal biomass will decline under all emission scenarios, driven by increasing temperature and decreasing primary production. Notably, climate change impacts are amplified at higher food web levels compared with phytoplankton. Our ensemble projections provide the most comprehensive outlook on potential climate-driven ecological changes in the global ocean to date and can inform adaptive management and conservation of marine resources under climate change.\n\n**Abstract**\n\nWhile the physical dimensions of climate change are now routinely assessed through multimodel intercomparisons, projected impacts on the global ocean ecosystem generally rely on individual models with a specific set of assumptions. To address these single-model limitations, we present standardized ensemble projections from six global marine ecosystem models forced with two Earth system models and four emission scenarios with and without fishing. We derive average biomass trends and associated uncertainties across the marine food web. Without fishing, mean global animal biomass decreased by 5% (±4% SD) under low emissions and 17% (±11% SD) under high emissions by 2100, with an average 5% decline for every 1 °C of warming. Projected biomass declines were primarily driven by increasing temperature and decreasing primary production, and were more pronounced at higher trophic levels, a process known as trophic amplification. Fishing did not substantially alter the effects of climate change. Considerable regional variation featured strong biomass increases at high latitudes and decreases at middle to low latitudes, with good model agreement on the direction of change but variable magnitude. Uncertainties due to variations in marine ecosystem and Earth system models were similar. Ensemble projections performed well compared with empirical data, emphasizing the benefits of multimodel inference to project future outcomes. Our results indicate that global ocean animal biomass consistently declines with climate change, and that these impacts are amplified at higher trophic levels. Next steps for model development include dynamic scenarios of fishing, cumulative human impacts, and the effects of management measures on future ocean biomass trends."
    },
    {
        "created_time": "2022-01-04 17:52:58",
        "self_text": "Bunch of good things in this thread and a bunch of ... not perse relevant stuff. I'll try to unpack the two most important factors you need to understand to get to the answer you're looking for.\n\nWhilst there are many factors influencing temperature on a planet in the solar system, the single most important one is due to *radiative forcing* that exists because some planets have an atmosphere. Planets (or moons) without an atmosphere are freezing because all the sunlight they get is radiated as warmth back into space. Our atmosphere, however traps this radiated warmth and keeps us in a cosy safe temperature range for carbon based life to exist. \n\nSome examples: Venus has a strong atmosphere and very warm temperatures. Mars on the other hand has a very thin atmosphere and the temperatures are way lower even than Earth's. The atmosphere matters way more than the relative distance to the sun, again, because it is really about how efficiently the suns energy is trapped (a lot of variety between planets) versus how much of the suns rays reach a planet (not that much difference between the planets). \n[Source: planet temperatures.](http://earthguide.ucsd.edu/eoc/special_topics/teach/sp_climate_change/p_planet_temp.html) [Source: planet amospheres.](https://www.britannica.com/science/atmosphere/The-atmospheres-of-other-planets)\n\nOur next part to unpack is what in this atmosphere has the greatest effect on the radiative forcing (or blanket effect) of our Earth's atmosphere. Gases make up our atmosphere, but the one gas that contributes most to the blanket effect is Carbon Dioxide, or CO_2 (the 2 is supposed to be subscript but im not reddit savvy enough to figure that out).\n\nThere are other so called greenhouse gases like CO_2 that contribute to the greenhouse or blanket effect, like methane which is 25x more potent than carbon dioxide  or nitrous oxide or the fluorogases, but they end up contributing just a fraction to the total warming because there is so little of them compared to carbon dioxide. [Source: Climate forcing contribution](https://www.epa.gov/climate-indicators/climate-change-indicators-climate-forcing)\n\nThe last part to this puzzle is whether the amount of carbon dioxide and other greenhouse gases in the atmosphere are a result of human societies activity (we call those *anthropogenic emissions* or because of natural emissions from processes that humans take no part in. And that has a clear and unequivocal answer: Humans are by far the most important driver of carbon emissions. Even if you correct for natural cycles, periodic fluctuations, etc. And nore inportantly, the insanely quick rise of those emissions in the relatively short period of the industrial revolution where fossil fuels (the main source of our carbon emissions) are by far the most rapid and alarming changes that have been recorded in history.\n[Source: anthropogenic emissions](https://energyeducation.ca/encyclopedia/Anthropogenic_carbon_emissions) [Source: History of carbon dioxide concentration](https://earth.org/data_visualization/a-brief-history-of-co2/)\n\nLet me know if anything is unclear"
    },
    {
        "created_time": "2024-02-09 22:17:14",
        "self_text": "&gt;Of course parents care.\n\nNo, not all of the time. My mom was a narcissist. She wanted me to fail so I'd never be able to get a job and be able to move out. I still did graduate, but I was being sabotaged by my own mother. I'm not the first or last child to be facing the same situation. \n\nAnother couple of friends had mothers that only cared about their daughter's appearance. For them, success for a woman is marrying a wealthy man. School is only good as a babysitter for parents like them. One of my mom's friends would keep her girls home just to clean the house. Hell, she said that was the only reason she had them. \n\nNo, parents don't always care. One can argue that the kids like that shouldn't be in school, but they do have to be somewhere. We can't stop people from having kids they intend to abuse."
    },
    {
        "created_time": "2024-02-03 04:58:25",
        "self_text": "Submission Statement: Deep Sea Fish &amp; the human Genome…take care of the fish &amp; Oceans…they hold the keys to life…\n\nThe fish wondered…Has the ocean always been this salty? Life is truly a Beach…\n\nThe ocean hasn’t always been THIS salty…eventually it will become the Dead Sea due to the many alkaline &amp; briny wastes created by chemical companies 😢\n\nit’s the moment I realized that during lithium mining the first pan of it produces Halite, or common table salt. I guess they were so desperate to profit they advertised it as a food condiment &amp; preservative…have you taken your lithium today?\n\nsince lemons are human-made hybrids out of citron &amp; bitter orange (mandarin/pomelo hybrid) it should show that Earth itself was never this salty…it was neutrally sweet with hints of the sour tropical tang…found near the slightly salted oceans…\n\nNow the Earth &amp; its waters are becoming so saturated with briny salts &amp; the tropical fruits are being engineered into sweet hybrids…but what if the existence &amp; purpose of their bitterness was the result of filtering the naturally salted ocean(s)? \n\nIf they are made sweeter can they biologically keep up with an ocean full of alkalines…they do convert the deadly salts into edible acids afterall…not sugar…in fact, they may help the body, by slowing the process of converting carbohydrates into sugars…&amp; most processed foods contain lots of carbohydrates &amp; sugar, which may lead to diabetes and/or weight gain."
    },
    {
        "created_time": "2024-02-14 15:59:41",
        "self_text": "You have never had a large scale garden that could feed people for most meals have you?  It take a decent amount of time for upkeep, knowledge and space its not unachievable but there is a reason its not so easy that people who have complained about prices dont just do it themselves.  \n\nI too have looked at planting more tree along city streets for this but getting enough people to pick the trees and then you have a lot for one time of the year.\n\nPlus doctors, medical equipment, and medicine are not just cheap and easy to get, many hospitals cannot find enough people"
    },
    {
        "created_time": "2023-08-17 22:48:11",
        "self_text": "&gt;No need to be condescending. In fact, I have a doctorate in hydrological engineering and am specialised in flood emergencies. I have a pretty good grasp on this type of thing.\n\nI'm sorry if I was coming across condescending but it wasn't intentional &amp; I was just repeating myself &amp; explaining my logic in detail so theirs no lack of communication &amp; you understand my way of thinking.\n\n&gt;There's a huge difference in the specific areas burned and the ability to control these fires. You seem to be suggesting that the elevated number of people affected this year is pure coincidence. The reality is, in previous years fire management has been able to protect these areas. In contrast, the fire approaching YK has been being fought for over a month and stampeding last every defence.\n\nI think your underestimating how fast fires can spread in very dry hot conditions &amp; making assumptions.\n\nLet me put it to you like this. There're are 8,000 wildfires every year in Canada I'm guessing lots of them are in the middle of nowhere &amp; their caught in time to control them.\n\nAll it takes is one or maybe a few fires that spread fast due to dry hot conditions &amp; by the time the firefighters hear about it it's out of control.\n\nFire is extremely volatile &amp; highly unpredictable &amp; hot droughts which aren't unusual will just make them spread extremely fast."
    },
    {
        "created_time": "2024-03-05 14:48:06",
        "self_text": "I think you're misunderstanding. People in open relationships are aware that risks of thier partner choosing to leave, or choosing another person. That's a risk that still exist in 'closed' or monogamous relationships. Being open should mean feeling secure in thier choice to be together, but also perfectly aware of the fact that choice *can change*.\n\nA healthy open relationship allows for that possibility without dreading it, or trying to defend against it with lies or with complete self-denial.\n\nMost relationships end. The risk is always there. All relationships are about choices. What most ENM/open people I know will say, is the risk is more or less the same for monagamous people, only when you're open, you ideally face that risk of the relationship agreement breaking down, or just changing over time, with a bit more transparency and honesty."
    }
]