[
    {
        "created_time": "2021-10-26 02:15:12",
        "self_text": "The patriarchy is already dead.  I don’t need to prove anything.  It is powerless to defend itself.  Neither I nor any feminist needs to do anything to further kill it.  I’m only paying any attention to it at all to dance on its corpse to taunt you.\n\nGod existed before the patriarchy and God lives on after its demise.  Your contempt for what you see as “feminine faith” is your contempt for the risen Christ and your love for the corpse of the patriarchy (which weak men have clung to throughout the millennium).  Patriarchy has misled you.  Turn your back on it and turn toward Christ.  There’s still time.  God is faithful even when we fall away and chase after idols."
    },
    {
        "created_time": "2022-11-29 17:04:44",
        "self_text": "&gt;“Nobody wins in a strike”: That’s a direct quote from my father when he was president of a union and actually had to manage an actual strike.  \n&gt;  \n&gt;That seemed as incredulous to me as it does to you: “Then why do it?” - and the answer was to prevent things from becoming even worse, when there is no other choice.\n\nI have been a part of multiple strikes and organized two. There is no question that it is a war of attrition, and that it comes out of desperation. But that desperation clearly *exists* in this case; railroad workers are willing to risk federal violence to resist the rail barons and earn the right to dignity at work. Who are you to take that right from them? What right do the millionaire business owners and landlords that make up our Congress have to take it from them?\n\nStrikes *do* have the power to improve conditions; strikes built our now-diminishing workplace rights. Successful strikes enshrine important contract protections that are much harder to erase in subsequent contracts. Successful strikes build worker solidarity and strengthen subsequent bargaining teams. I have seen this happen; I have seen how contract protections grow cycle after cycle when an engaged and mobilized membership uses their labor power. With no disrespect to your father, who undoubtedly organized in a very different environment, that kind of doomerism and lack of historical and material awareness is what led to a collaborationist and enervated labor movement in the first place. Strikes can fail, but without a strike there is no chance of success in the first place in the vast majority of negotiations.\n\nAhistorical understandings of past strikes aside (believe it or not the longshoremen's union of New York still exists and still moves major cargo, and their history and the history of US shipping is far more complicated than that; take as a counterpoint the relatively huge power of the ILWU on the west coast), the idea that the US rail industry, which made $22B *in pure profit* last year alone and which moves 1/3 of freight in this country, is going to fold over this is bananas.\n\nThe labor movement needs to recognize, especially after this, that we have no allies in power protecting us. Not anymore. At best we are a pawn used by politicians, all of whom are owned by our bosses, to gain momentary leverage over one another. Our only power is our labor power, and we *must* exercise it."
    },
    {
        "created_time": "2022-05-07 00:26:54",
        "self_text": "“Republicans, for the most part, sought to soften their rhetoric after decades of hardline antiabortion talk. The National Republican Senatorial Committee distributed a memo encouraging GOP candidates to be [the compassionate consensus builder on abortion policy].  Republicans, If you want to be compassionate, tell your Republican friends not to pass laws that make no exception for rape or incest. And other extremist laws like charging a woman with murder.  You have really gone off the rails.  And no talking point about being compassionate will change that.  While conservative evangelicals will look at this as a moral victory, fundamentalism is not about religion. It’s about power.  Whether you have rights should not depend on whether you live in a red state or a blue state.  Put that in your talking points."
    },
    {
        "created_time": "2021-12-05 02:21:27",
        "self_text": "Just out of curiosity: are you referring to people that own like a lot of property- or anyone that owns more than 1 home and rents the other? I rent 3 properties and I have not jacked up prices at all to match surrounding rentals (which have skyrocketed). In fact, I lowered ones rent after I was able to refinance and get lower mortgage payments. Owning and renting is not evil, it's investing. \n\nNow I DO agree that landlords that rate hike to take advantage of a unfair market AND are shitty landlords on top of that are living, breathing, walking trash heaps"
    },
    {
        "created_time": "2021-11-28 02:31:25",
        "self_text": "I’d go for the following:\n\n- legalize “missing middle housing” by overriding municipal zoning laws with a federal zoning system similar to Japan’s.\n\n- legalize mixed use developments everywhere with a similar policy.\n\n- pass a progressive land tax that would exempt building and increase in incidence the more value (ergo larger) land is.\n\n- mandate densification along transit lines and especially around stations + massive transit investments.\n\n- bring back loans to housing cooperatives except on even more favourable terms (100% of land costs born by the government, otherwise a negative interest loan with a fifty year amortization period).\n\n- adopt an RGI scheme with funds to housing cooperatives to ensure they can afford to subsidize housing charges such that no one pays more than 30% of their income."
    },
    {
        "created_time": "2024-04-21 11:26:13",
        "self_text": "&gt;Care to make a point?\n\nA bit of humility would suit you, because the rest of your posts seems to indicate you are not aware of the fundamental arguments of more collective economic philosophies (e.g. socialism, communism).\n\nYou don't have to agree with those arguments, but not being aware of them and then dismissing someone trying to slowly discuss with you to get their way does not make you look like you are arguing in good faith.\n\n&gt;they were compensated according to the free market, aka supply and demand. They could have simply chosen to not do that.\n\nBecause this is where a lot of people start to fundamentally disagree with you. How much of a free choice do you as employee have, really? How free is the market *really*? 'Supply and Demand' is essentially high-school level economics. And like most things taught to you in high school, it is an extreme simplification."
    },
    {
        "created_time": "2024-01-03 16:14:57",
        "self_text": "https://archive.is/O2HSP\n\n\n&gt;The question for Europeans today, as the war in Ukraine rolls on and the European Parliament elections loom, is simple: is it wise to assume that our democracies are strengthened when we hand over our foreign policy and defence to Nato — in other words, to the US government? Or did the Athens Polytechnic students, along with General De Gaulle, have a point when they feared that unthinking allegiance to Nato would accelerate Europe’s steady slide into vassal continent status? Personally, I will always side with the students.\n\nYep. The purpose of NATO is to maintain US hegemony at the expense of the sovereignty of other member states."
    },
    {
        "created_time": "2024-05-05 14:30:41",
        "self_text": "Notice that the same Trump haters on this sub that are terrified of Trump cause the media tells them he says ‘bloodbath’, those same people see no problem with this.  \n\nThe people in the Biden administration that are responsible for setting the policies that they are forced to live by, are completely ignorant of the very basics of the areas of society that they are tasked with governing.  \n\nHow does this happen?  Because too many people in this country see ‘Mean Tweets’ as being the threat we must address, and not this.\n\nI hate to tell you guys but if you can look at this guy and look at 45 and decide that Trump is the guy you need to be worried about, then you deserve to be governed by the other guy."
    },
    {
        "created_time": "2023-12-31 22:00:05",
        "self_text": "Yes.  Messaging on MANY issues necessarily requires a fine line. Preservation of democracy is the major issue, by far, facing the country. And it will require decades to accomplish. All other issues, most unfortunately, need to at least partially recede into the background. Not completely, but addressed in a way that progressives will not be entirely happy with.  \n\nI wish it wasn't so, but it is. Sadly, right-wing bullshit has too many people in its grasp.  And we have to try to be pragmatic about it. For awhile. But for now, the worst possible outcome would be for progressives to avoid voting for Biden because he's not liberal enough."
    },
    {
        "created_time": "2024-04-20 20:30:04",
        "self_text": "The US?\n\nHow so? \n\nThe NNPT requires the following from nuclear power signatories to the treaty:\n\n[nuclear-weapon States parties have committed not to in any way assist, encourage or induce any non-nuclear-weapon State party to manufacture or otherwise acquire nuclear weapons or other nuclear explosive devices.](https://www.iaea.org/topics/non-proliferation-treaty)\n\nThe US has not (*to my knowledge*) assisted, encouraged or induced any country which signed the NNPT as a non-nuclear state to pursue or obtain nuclear weapons or explosive devices.\n\nNuclear state parties have also committed not to use nuclear weapons against non-nuclear state parties but I'm pretty sure I would have noticed if the US had nuked anyone recently."
    }
]